Revit 2026 API

# AssetPropertyDoubleMatrix44Value Property

---

Get the value of the property

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DoubleArray Value { get; }
```
```vb
Public ReadOnly Property Value As DoubleArray
	Get
```
```cpp
public:
property DoubleArray^ Value {
	DoubleArray^ get ();
}
```
```fsharp
member Value : DoubleArray with get
```

#### Property Value

DoubleArray

#### Reference

AssetPropertyDoubleMatrix44 Class

Autodesk.Revit.DB.Visual Namespace